const TermsOfUse = () => {
  return (
    <section className="flex flex-col custom-nested-list sm:text-base text-sm">
      <div className="mb-6">
        <div className="text-center font-bold mb-6">
          ข้อกำหนดและเงื่อนไขตกลงการใช้งาน
        </div>
        <p className="mt-4">
          บริษัท วิสัย เอไอ จำกัด (ต่อไปนี้จะเรียกว่า “บริษัทฯ”)
          ได้กำหนดข้อกำหนดและเงื่อนไขตกลงการใช้งาน (ต่อไปนี้จะเรียกว่า
          “ข้อกำหนดและเงื่อนไขฯ”) ซึ่งในข้อกำหนดและเงื่อนไขฯ
          ฉบับนี้ได้กำหนดข้อตกลงระหว่างบริษัทฯ และผู้ใช้บริการ ข้อมูล
          หรือคุณลักษณะใดๆ (ต่อไปนี้จะเรียกว่า “ผู้ใช้”) ของบริษัทฯ
        </p>
      </div>
      <ol className="list-decimal">
        <li className="my-2.5">
          <span className="font-bold">คำนิยาม</span>
          <p className="mt-1 ">
            เราดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ดังต่อไปนี้
          </p>
          <ol>
            <li className="my-2.5">
              ”ชุดข้อมูล” หมายถึง ข้อมูลที่มีคุณลักษณะใดๆ
              เหมือนกันนำมาจับกลุ่มรวมกัน
            </li>
            <li className="my-2.5">
              ”โมเดล” หมายถึง ระบบสมการเชิงคณิตศาสตร์ ที่ใช้ในการแก้ไขปัญหา
            </li>
            <li className="my-2.5">
              ”อุปกรณ์ประมวลผล” หมายถึง
              อุปกรณ์หรือเครื่องมือที่ใช้ในการคำนวณระบบสมการเชิงคณิตศาสตร์
            </li>
            <li className="my-2.5">
              ”บริการฯ” หมายถึง การบริการ ข้อมูล และอื่น ๆ
              ในทำนองเดียวกันของบริษัทฯ
            </li>
            <li className="my-2.5">
              ”ข้อกำหนดและเงื่อนไขฯ เพิ่มเติม” หมายถึง เอกสารที่ทางบริษัทฯ
              ออกและอัปโหลด ภายใต้ชื่อ “ข้อกำหนด” “เงื่อนไข” “นโยบาย” และอื่นๆ
              ในทำนองเดียวกัน
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">ข้อตกลงยอมรับข้อกำหนดและเงื่อนไขฯ</span>
          <ol>
            <li className="my-2.5">
              ผู้ใช้ทุกรายจะต้องตกลงยอมรับข้อกำหนดและเงื่อนไขฯ ของทางบริษัทฯ
              จึงจะสามารถใช้บริการฯ ของทางบริษัทฯ
              การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้
            </li>
            <li className="my-2.5">
              การที่ผู้ใช้ใช้บริการฯ ถือว่า ผู้ใช้ยอมรับข้อกำหนดและเงื่อนไขฯ
              การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้
            </li>
            <li className="my-2.5">
              หากมีข้อกำหนดและเงื่อนไขฯ เพิ่มเติม
              ผู้ใช้จะต้องปฏิบัติตามข้อกำหนดและเงื่อนไขฯ เพิ่มเติมนั้นด้วย
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">การแก้ไขข้อกำหนดและเงื่อนไขฯ</span>
          <p className="mt-1 ">
            บริษัทฯ ถือเอกสิทธิ์ในการแก้ไขข้อกำหนดและเงื่อนไขฯ
            และข้อกำหนดและเงื่อนไขฯ เพิ่มเติม ตามดุลยพินิจบริษัทฯ
            โดยที่ไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้า ข้อกำหนดและเงื่อนไขฯ
            และข้อกำหนดและเงื่อนไขฯ เพิ่มเติมมีผลบังคับใช้สมบูรณ์ เมื่อบริษัทฯ
            ได้ทำการอัปโหลดหรือแก้ไขภายในเว็บไซต์ของบริษัทฯ
            การที่ผู้ใช้ใช้บริการฯ ต่อไป ถือว่าผู้ใช้ยอมรับข้อกำหนดและเงื่อนไขฯ
            ฉบับแก้ไขล่าสุดและข้อกำหนดและเงื่อนไขฯ เพิ่มเติม ฉบับแก้ไขล่าสุด
            การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้
          </p>
        </li>
        <li className="my-2.5">
          <span className="font-bold">การคุ้มครองข้อมูลส่วนบุคคล</span>
          <p className="mt-1 ">
            บริษัทฯ
            ให้คำมั่นสัญญาว่าจะคุ้มครองความเป็นส่วนตัวและข้อมูลส่วนบุคคลของผู้ใช้
            ตาม “นโยบายความเป็นส่วนตัว” ที่อัปโหลดภายในเว็บไซต์ของบริษัทฯ
            และให้ความระมัดระวัง
            ใส่ใจอย่างสูงสุดเกี่ยวกับมาตรการรักษาความปลอดภัยของข้อมูลใดๆ
            ของผู้ใช้ทั้งหมด
          </p>
        </li>
        <li className="my-2.5">
          <span className="font-bold">การให้บริการฯ</span>
          <ol>
            <li className="my-2.5">
              บริษัทฯ สงวนสิทธิ์ที่จะจำกัดการเข้าถึงบริการฯ
              ทั้งหมดหรือบางส่วนของผู้ใช้ ขึ้นอยู่กับนโยบายของบริษัทฯ
            </li>
            <li className="my-2.5">
              บริษัทฯ ถือเอกสิทธิ์ที่จะเปลี่ยนแปลงหรือยุติบริการฯ
              ทั้งหมดหรือเพียงบางส่วนตามดุลยพินิจและนโยบายของบริษัทฯ
              ไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้า
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">
            ชุดข้อมูล โมเดล และการบริการอุปกรณ์ประมวลผล
          </span>
          <ol>
            <li className="my-2.5">
              ชุดข้อมูลและโมเดลที่คิดค้นในนามบริษัทฯ บริษัทฯ
              อนุญาตให้ผู้ใช้เพื่อวัตถุประสงค์ในการใช้บริการฯ เท่านั้น
              โดยเป็นการอนุญาตให้ใช้สิทธิที่โอนต่อไม่ได้ นำไปให้อนุญาตใหม่ไม่ได้
              และอนุญาตให้ใช้สิทธิโดยไม่จำกัดแต่เพียงผู้เดียว
            </li>
            <li className="my-2.5">
              ในกรณีที่ผู้ใช้คัดลอก แก้ไข
              และดัดแปลงชุดข้อมูลและโมเดลที่คิดค้นในนามบริษัทฯ
              เพื่อทำสินค้าและบริการอื่นใด บริษัท
              จะยังคงเป็นเจ้าของสิทธิในทรัพย์สินทางปัญญาและสิทธิอื่นๆ ในบริการฯ
              ที่บริษัทฯ เสนอต่อผู้ใช้ และจะไม่มีการโอนสิทธิต่างๆ
              ดังกล่าวไปให้แก่ผู้ใช้
            </li>
            <li className="my-2.5">
              ผู้ใช้ที่บริการอุปกรณ์ประมวลผล บริษัทฯ
              ไม่มีส่วนในการรับผิดชอบการสูญหายของข้อมูลที่ผู้ใช้ใช้ก่อน
              ระหว่างหรือเสร็จสิ้นการประมวลผลในอุปกรณ์ประมวลผล
              ไม่ว่าทั้งหมดหรือเพียงบางส่วน
            </li>
            <li className="my-2.5">
              ผู้ใช้จะต้องไม่ใช้บริการฯ
              เกินจากขอบเขตของการใช้งานตามวัตถุประสงค์ของการบริการฯ
            </li>
            <li className="my-2.5">
              บริษัทฯ อาจตรวจสอบรายละเอียดของการใช้งานจากผู้ใช้ หากบริษัทฯ
              เห็นว่า การใช้งานของผู้ใช้อาจฝ่าฝืนกฎหมายหรือข้อกำหนดและเงื่อนไขฯ
              อย่างไรก็ตาม บริษัทฯ
              ไม่มีภาระหน้าที่จะต้องดำเนินการตรวจสอบดังกล่าว
            </li>
            <li className="my-2.5">
              หากบริษัทฯ เห็นว่า ผู้ใช้ได้ฝ่าฝืนหรืออาจฝ่าฝืนกฎหมาย
              หรือข้อกำหนดและเงื่อนไขฯ ที่เกี่ยวกับการใช้งานของผู้ใช้ บริษัทฯ
              สงวนสิทธิที่จะตัดสิทธิของผู้ใช้ในการที่จะบริการฯ ในบางลักษณะ เช่น
              การระงับการเข้าถึงผู้ใช้ โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">ข้อจำกัด</span>
          <p className="mt-1">
            ผู้ใช้จะต้องไม่กระทำพฤติกรรมดังต่อไปนี้เมื่อใช้บริการฯ
          </p>
          <ol>
            <li className="my-2.5">
              กิจกรรมที่ฝ่าฝืนกฎหมาย คำพิพากษา มติหรือคำสั่งศาล
              หรือมาตรการทางปกครองที่มีผลผูกพันทางกฎหมาย
            </li>
            <li className="my-2.5">
              กิจกรรมที่ละเมิดสิทธิในทรัพย์สินทางปัญญา เช่น ลิขสิทธิ์
              เครื่องหมายการค้าและสิทธิบัตร ชื่อเสียง ความเป็นส่วนตัว
              และสิทธิอื่น ๆ ทั้งหมดของบริษัทฯ
              และ/หรือบุคคลภายนอกที่มีการมอบให้ตามกฎหมายหรือตามสัญญา
            </li>
            <li className="my-2.5">
              กิจกรรมที่อาจทำให้ผู้อื่นเข้าใจผิดเกี่ยวกับบริษัทฯ
              และ/หรือบุคคลภายนอก หรือการจงใจเผยแพร่ข้อมูลเท็จ
            </li>
            <li className="my-2.5">
              กิจกรรมที่มีการแลกเปลี่ยนสิทธิในการใช้เนื้อหาฯ เป็นเงินสด
              ทรัพย์สิน หรือผลประโยชน์ทางเศรษฐกิจอื่นๆ
              โดยไม่ได้รับอนุญาตจากบริษัทฯ
            </li>
            <li className="my-2.5">
              กิจกรรมที่แทรกแซงเครื่องแม่ข่าย และ/หรือระบบเครือข่ายของบริการฯ
              กิจกรรมซึ่งเป็นการใช้บริการฯ ในทางที่ผิดด้วยการใช้บ็อท (BOTs)
              เครื่องมือเพื่อการโกง หรือวิธีการทางเทคนิคอื่นๆ
              กิจกรรมที่ใช้ข้อบกพร่องของบริการฯ โดยไตร่ตรองไว้ก่อน
              และกิจกรรมที่แทรกแซงการให้บริการฯ ของบริษัทฯ หรือการใช้บริการฯ
              ของผู้ใช้
            </li>
            <li className="my-2.5">
              กิจกรรมที่ให้ความช่วยเหลือหรือส่งเสริมกิจกรรมใด ๆ ที่ระบุไว้ในข้อ
              1 ถึงข้อ 5 ข้างต้น
            </li>
            <li className="my-2.5">
              กิจกรรมอื่น ๆ ที่บริษัทฯ เห็นว่าไม่เหมาะสม
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">ความรับผิดชอบของผู้ใช้</span>
          <ol>
            <li className="my-2.5">
              ผู้ใช้ที่ใช้บริการของบริษัทฯ
              ต้องยอมรับโดยเป็นความเสี่ยงของผู้ใช้เอง
              และจะต้องรับผิดชอบแต่เพียงผู้เดียวต่อสำหรับการกระทำที่กระทำไปและผลของการกระทำที่มีต่อบริการฯ
              นี้
            </li>
            <li className="my-2.5">
              บริษัทฯ อาจใช้มาตรการที่ทางบริษัทฯ เห็นว่าเหมาะสม หากทางบริษัทฯ
              ทราบว่าผู้ใช้ใช้บริการฯ ที่ฝ่าฝืนข้อกำหนดและเงื่อนไขฯ
              หรือข้อกำหนดและเงื่อนไขฯ เพิ่มเติม โดยที่บริษัทฯ
              ไม่ต้องรับผิดชอบในการกระทำของบริษัทฯ ต่อผู้ใช้และบุคคลอื่น
              ของการฝ่าฝืนดังกล่าว
            </li>
            <li className="my-2.5">
              กรณีที่เกิดความเสียหายหรือสูญเสียแก่บริษัทฯ หรือบริษัทฯ
              ถูกเรียกเก็บค่าใช้จ่ายทุกประเภทไม่มีข้อยกเว้น
              ไม่ว่าทางตรงหรือโดยอ้อม
              อันเนื่องมาจากที่ผู้ใช้ละเมิดข้อกำหนดและเงื่อนไขฯ
              หรือข้อกำหนดและเงื่อนไขฯ เพิ่มเติม ในการใช้บริการฯ
              ผู้ใช้จะต้องชดใช้ค่าเสียหายแก่บริษัทฯ ทันทีที่บริษัทฯ ร้องขอ
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">การยกเว้นความรับผิดของบริษัทฯ</span>
          <ol>
            <li className="my-2.5">
              บริษัทฯ ไม่รับประกันไม่ว่าโดยชัดแจ้งหรือโดยปริยายว่า บริการฯ
              จะปราศจากข้อบกพร่องตามจริงหรือตามกฎหมายทุกประเภทไม่มีข้อยกเว้น
              และทางบริษัทฯ ไม่มีความรับผิดชอบในการจัดหาบริการฯ
              ที่ไม่มีข้อบกพร่องดังกล่าว
            </li>
            <li className="my-2.5">
              บริษัทฯ ไม่ต้องรับผิดชอบต่อค่าเสียหายทุกประเภทไม่มีข้อยกเว้น
              ที่เกิดขึ้นกับผู้ใช้อันเกี่ยวกับการใช้บริการฯ
            </li>
            <li className="my-2.5">
              บริษัทฯ ไม่ต้องรับผิดชอบต่อค่าเสียหายโดยอ้อม ค่าเสียหายพิเศษ
              ค่าเสียหายเนื่องจากการผิดสัญญา
              ค่าเสียหายต่อเนื่องหรือค่าเสียหายเชิงลงโทษใดๆ
              ในส่วนที่เกี่ยวกับการผิดสัญญาหรือการกระทำละเมิดของบริษัทฯ
              เนื่องจากความประมาทบริษัท (ยกเว้นความประมาทอย่างร้ายแรง)
              ค่าชดเชยสำหรับค่าเสียหายตามปกติในส่วนที่เกี่ยวกับการผิดสัญญาหรือการกระทำละเมิดของบริษัท
              เนื่องจากความประมาทของบริษัทฯ (ยกเว้นความประมาทอย่างร้ายแรง)
              จะจำกัดไว้ที่จำนวนเงินรวมของค่าบริการที่ได้รับจากผู้ใช้ในเดือนปฏิทินที่เกิดค่าเสียหายดังกล่าวขึ้น
            </li>
          </ol>
        </li>
        <li className="my-2.5">
          <span className="font-bold">การแจ้งเตือนและการติดต่อ</span>
          <p className="mt-1">
            บริษัทฯ จะแจ้งหรือติดต่อผู้ใช้ฯ ตามความเหมาะสมที่บริษัทฯ เห็นสมควร
          </p>
        </li>
        <li className="my-2.5">
          <span className="font-bold">กฎหมายที่บังคับและเขตอำนาจ</span>
          <p className="mt-1">
            ความขัดแย้งที่เกิดขึ้นจากบริการฯ
            หรือความขัดแย้งระหว่างผู้ใช้และบริษัทฯ ที่เกี่ยวกับบริการฯ
            จะอยู่ภายใต้บังคับของเขตอำนาจเด็ดขาดของศาลประเทศไทยเป็นสำคัญ
          </p>
        </li>
      </ol>
    </section>
  );
};

export default TermsOfUse;
