const CookiePolicyPage = () => {
  return (
    <div className="max-w-[1280px] md:mt-10 mt-8 mb-14 md:mb-20 mx-auto px-4 md:px-6 lg:px-12">
      <div className="text-center">
        <div>นโยบายการใช้คุกกี้ (Cookie Policy)</div>
        <div className="mt-4">ของบริษัท วิสัย เอไอ จำกัด</div>
      </div>
      <hr className="my-6 border-t border-black border-dashed" />
      <p className="text-justify">
        บริษัท วิสัย เอไอ จำกัด (“วิสัย”)
        เคารพในสิทธิความเป็นส่วนตัวของผู้เข้าชม และ/หรือผู้ใช้เว็บไซต์
        (“ผู้เข้าชม/ผู้ใช้เว็บไซต์”)
        และตระหนักถึงความคาดหวังของผู้เข้าชม/ผู้ใช้เว็บไซต์ว่าข้อมูล (“ข้อมูล”)
        ที่ผู้เข้าชม/ผู้ใช้เว็บไซต์ได้ให้ไว้กับ วิสัย ผ่านเว็บไซต์นี้
        (“เว็บไซต์”) จะได้รับความคุ้มครองอย่างเหมาะสม วิสัย
        จึงขอประกาศนโยบายการใช้คุกกี้ (“นโยบายการใช้คุกกี้”) สำหรับเว็บไซต์นี้
        การใช้คุกกี้
      </p>
      <p className="my-6">
        คุกกี้ คือ ไฟล์ข้อความขนาดเล็ก ซึ่งประกอบด้วยตัวอักษรและตัวเลข ที่ วิสัย
        จัดเก็บไว้ในเบราว์เซอร์หรือฮาร์ดดิสก์ของคอมพิวเตอร์ของท่าน,
        แท็บเล็ตของท่าน หรืออุปกรณ์สื่อสารพกพาของท่าน วิสัย
        อาจเก็บข้อมูลของท่านผ่านทางคุกกี้เหล่านี้ เมื่อท่านเข้าชมเว็บไซต์ของเรา
      </p>
      <p className="my-6">
        รายละเอียดคุกกี้แต่ละประเภทของ วิสัย ที่อาจจะถูกใช้งานในเว็บไซต์มีดังนี้
      </p>
      <ol className="list-decimal pl-2">
        <li className="my-2.5">
          <span className="font-bold underline">คุกกี้ที่จำเป็น</span>
          <p className="mt-1">
            คุกกี้นี้จำเป็นสำหรับการทำงานของเว็บไซต์และไม่สามารถปิดได้
            เพื่อให้คุณสามารถใช้งานเว็บไซต์และเข้าถึงฟีเจอร์พื้นฐานได้อย่างถูกต้อง
          </p>
        </li>
        <li className="my-2.5">
          <span className="font-bold underline">คุกกี้ในส่วนวิเคราะห์</span>
          <p className="mt-1">
            คุกกี้ในส่วนวิเคราะห์จะช่วยให้เข้าใจรูปแบบการใช้งานของผู้เข้าชมปละจะช่วยปรับปรุงประสบการณ์การใช้งาน
            โดยการเก็บรวบรวมข้อมูลและรายงานผลการใช้งานของผู้ใช้งาน
          </p>
        </li>
        <li className="my-2.5">
          <span className="font-bold underline">คุกกี้ในส่วนการตลาด</span>
          <p className="mt-1">
            คุกกี้ในส่วนการตลาดใช้เพื่อติดตามพฤติกรรมผู้เข้าชมเว็บไซต์เพื่อแสดงโฆษณาที่เหมาะสมสำหรับผู้ใช้งานแต่ละรายและเพื่อเพิ่มประสิทธิผลการโฆษณาสำหรับผู้เผยแพร่และผู้โฆษณาสำหรับผู้เผย
            แพร่และผู้โฆษณาสำหรับบุคคลที่สาม
          </p>
        </li>
      </ol>
      <div className="my-4">
        <div className="font-bold">คุกกี้ของบุคคลที่สาม</div>
        <p className="mt-1">
          ในบางกรณี วิสัย
          ใช้คุกกี้ของบุคคลที่สามซึ่งเป็นพันธมิตรที่ได้รับความไว้วางใจจาก วิสัย
          ด้วย  เว็บไซต์นี้ใช้ Google Analytics
          ซึ่งเป็นหนึ่งในผู้ให้บริการวิเคราะห์เว็บไซต์ที่แพร่หลายและได้รับการไว้วางใจเป็นอย่างมากรายหนึ่งในการช่วยให้
          วิสัย เข้าใจว่าท่านใช้เว็บไซต์ของ วิสัย อย่างไร
          และเข้าใจแนวทางในการปรับปรุงประสบการณ์การท่องเว็บของท่านให้ดียิ่งขึ้น
          คุกกี้เหล่านี้อาจมีการติดตามสิ่งต่าง ๆ เช่น
          ระยะเวลาที่ท่านใช้ในการเข้าชมเว็บไซต์หรือหน้าเพจของ วิสัย
          ซึ่งจะส่งผลให้ วิสัย สามารถผลิตเนื้อหาที่น่าสนใจต่อไปได้
        </p>
      </div>
      <div className="my-4">
        <div className="font-bold">การเปลี่ยนแปลงการตั้งค่าคุกกี้</div>
        <p className="mt-1">
          ผู้เข้าชมหรือผู้ใช้เว็บไซต์
          สามารถใช้เครื่องมือควบคุมคุกกี้ของเว็บเบราว์เซอร์ในการเปลี่ยนแปลงการตั้งค่าคุกกี้ได้
          สำหรับข้อมูลเพิ่มเติมในการปรับตั้งค่า
          โปรดเยี่ยมชมหน้าเว็บไชต์ ตั้งค่าคุกกี้ อย่างไรก็ตาม วิสัย
          ขอแจ้งให้ท่านทราบว่า
          การปิดการใช้งานคุกกี้บางตัวอาจส่งผลกระทบต่อการทำงานของเว็บไซต์นี้
          และอาจส่งผลถึงขั้นที่ทำให้รูปแบบการทำงานหรือปฏิบัติการบางอย่างของเว็บไซต์ไม่สามารถใช้งานได้
        </p>
      </div>
      <div className="my-4">
        <div className="font-bold">รายละเอียดเพิ่มเติม</div>
        <p className="mt-1">
          หากท่านต้องการทราบข้อมูลเพิ่มเติมเกี่ยวกับสิทธิในความเป็นเจ้าของข้อมูลของท่าน
          ท่านสามารถเยี่ยมชม แบบแจ้งเกี่ยวกับข้อมูลส่วนบุคคลของวิสัย
        </p>
      </div>
      <div className="my-4">
        <div className="font-bold">การปรับปรุงนโยบายการใช้คุกกี้</div>
        <p className="mt-1">
          วิสัย
          มีการพิจารณาทบทวนและปรับปรุงนโยบายการใช้คุกกี้นี้ตามความเหมาะสมอยู่เป็นระยะ
          ท่านสามารถเข้าเยี่ยมชมหน้าเว็บไซต์นี้หากต้องการทราบนโยบายการใช้คุกกี้ฉบับปรับปรุงของ
          วิสัย ประกาศ ณ วันที่ 30/05/2565
        </p>
      </div>
    </div>
  );
};

export default CookiePolicyPage;
